{-# LANGUAGE EmptyDataDeriving #-}
-- cover all cases!
 {-# OPTIONS_GHC -fwarn-incomplete-patterns #-}
-- warn about incomplete patterns v2
{-# OPTIONS_GHC -fwarn-incomplete-uni-patterns #-}
-- write all your toplevel signatures!
{-# OPTIONS_GHC -fwarn-missing-signatures #-}
-- use different names!
{-# OPTIONS_GHC -fwarn-name-shadowing #-}
-- use all your pattern matches!
{-# OPTIONS_GHC -fwarn-unused-matches #-}
{-# OPTIONS_GHC -Wno-unrecognised-pragmas #-}

{-# HLINT ignore "Redundant if" #-}
{-# HLINT ignore "Eta reduce" #-}
{-# HLINT ignore "Use foldr" #-}

-- Да се напише функция, която приема списък от цели числа, предикат и функция
-- Списъка трябва да се филтрира чрез предиката. Накрая, върху всеки филтриран елемент трябва да се приложи функцията
-- Да се напише фунцкия, която "сгъва" списък от ляво надясно с подадена функция
-- За упражнение вкъщи: от дясно наляво
-- Да се напише функция, която премахва повтарящи се числа от списък
-- Да се напише функция, която приема списък и предикат и връща позициите на елементите, които удовлетворяват предиката
-- Да се напише функция, която приема списък от цели числа и връща резултата чрез прилагане последователно на + и - 
-- Да се напише функция, която приема списък от цели числа и връща списък от елементите, които са по-големи от двата си съседа

-- Да се дефинира тип за песен. Всяка песен има име, изпълнител, дължина в секунди и брой слушания
-- Да се дефинира тип за плейлист. Плейлиста има име и списък от песни
-- Да се напише функция, която връща името на най-слушаната песен 
-- Да се напише функция, която връща времето за слушане на цял плейлист в секунди
-- Да се напише функция, която превръща време в секунди в часове, минути и секунди
-- Да се дефинира тип за човек. Всеки човек има име, години и списък от плейлисти
-- Да се дефинира тип за слушатели. 
-- Да се напише функция, която приема слушатели и артист. Тя трябва да сортира слушателите по времето, което са слушали артиста. (merge sort)
-- Да се напише функция, която приема слушатели, артист и име. Тя трябва да върне процента слушатели, които са слушали по-малко от подадения човек.
-- Да се напише функция, която връща средната възраст на хората, които имат подаден артист в поне един от плейлистите си
-- Да се напише функция, която връща имената на всички плейлисти, разделени с подаден символ.
-- Да се напише функция, която приема списък от функции (Person -> Int) и слушатели. Тя прилага всяка функция върху всеки човек и връща двумерен списък от резултатите.