{-# LANGUAGE EmptyDataDeriving #-}
-- cover all cases!
{-# OPTIONS_GHC -fwarn-incomplete-patterns #-}
-- warn about incomplete patterns v2
{-# OPTIONS_GHC -fwarn-incomplete-uni-patterns #-}
-- write all your toplevel signatures!
{-# OPTIONS_GHC -fwarn-missing-signatures #-}
-- use different names!
{-# OPTIONS_GHC -fwarn-name-shadowing #-}
-- use all your pattern matches!
{-# OPTIONS_GHC -fwarn-unused-matches #-}
{-# OPTIONS_GHC -Wno-unrecognised-pragmas #-}

{-# HLINT ignore "Redundant if" #-}
{-# HLINT ignore "Eta reduce" #-}

-- Организационни въпроси:
-- Искате ли да преместим упражнението?

-- Какво представляват функционалните езици?
-- Какво представлява Haskell
-- Каква е разликата между дефиниция и декларация на функция

-- 1) Декларации на функции
-- Задача 1: Да се декларира функция, която приема едно цяло число и връща цяло число
-- Задача 2: Да се декларира функция, която приема две целия числа и връща цяло число
-- Задача 3: Да се декларира функция, която приема булева стойност, символ и символен низ и връща дробно число 

-- 2) Дефиниции на прости функции
-- Задача 1: Да се декларира и дефинира функция, която приема цяло число и връща същото число, събрано с единица
-- Задача 2: Да се напише функция, която събира две цели числа
-- Задача 3: Да се напише функция, която проверява дали подадено число е равно на 1, 3 или 5
-- Задача 4: Да се напише функция, която дели две числа. Приемаме, че ако делителят е 0, то резултата е 0
-- Задача 5: Фибоначи
-- Задача 6: Факториел
-- Задача 7: Проверка дали число е просто

-- 3) Списъци
-- Задача 1: Да се дефинира списък с числата от 1 до 5 (по два начина)
-- Задача 2: Да се напише функция, която приема две цели числа (a,b) и връща списък [a, a+2, ..., b или b+1]
-- Задача 3: Да се напише функция, която приема списък от цели числа и връща сумата им
-- Задача 4: Да се напише функция, която приема списък от цели числа и прилага следните операции:
 -- Първото число се добавя към резултата до момента (Първоначално 0)
 -- Второто число се изважда от резултата до момента
 -- Резултата до момента се умножава по третото число
 -- Резултата до момента се дели на четвъртото число
 -- Стъпките се повтарят до края на списъка и се връща резултата
-- Задача 5: Да се напише функция, която приема число и създава безкраен списък от това число
-- Задача 6: Да се напише функция, която приема произволна стойност и създава безкраен списък от нея
-- Задача 7: Да се напише функция, която приема списък и число n и връща първите n елемента от списъка 
-- Задача 8: Да се напише функция, която приема списък и число n и връща последните n елемента от списъка 
-- Задача 9: Да се напише функция, която приема стойност и цяло число (n) и създава списък, който съдържа стойността n пъти
