{-# LANGUAGE EmptyDataDeriving #-}
-- cover all cases!
 {-# OPTIONS_GHC -fwarn-incomplete-patterns #-}
-- warn about incomplete patterns v2
{-# OPTIONS_GHC -fwarn-incomplete-uni-patterns #-}
-- write all your toplevel signatures!
{-# OPTIONS_GHC -fwarn-missing-signatures #-}
-- use different names!
{-# OPTIONS_GHC -fwarn-name-shadowing #-}
-- use all your pattern matches!
{-# OPTIONS_GHC -fwarn-unused-matches #-}
{-# OPTIONS_GHC -Wno-unrecognised-pragmas #-}

{-# HLINT ignore "Redundant if" #-}
{-# HLINT ignore "Eta reduce" #-}
{-# HLINT ignore "Use foldr" #-}

-- :t <function>
-- :info <type>

-- Още малко работа със списъци

-- Да се напише функция, която обръща списък
-- Да се напише функция, която връща дължината на списък
-- Да се напише функция, която проверява дали елемент се съдържа в списък
-- Да се напише функция, която проверява дали всички елементи от един списък се съдържат във втори
-- Да се напише функция, която приема два списъка и ги превръща в списък от наредени двойки.
    -- В i-тата наредена двойка се съдържат елементите на двата масива, които се намират на индекс i

-- Функции от по-висок ред

-- Да се напише функция, която приема цяло число и функция Int->Int и прилага функцията върху числото
-- Да се напише функция, която приема списък и функция и прилага функцията върху всеки елемент на списъка
-- Да се напише функция, която приема списък, функция и предикат. Тя трябва да приложи първата функция върху всички елементи, чиито индекси удовлетворяват предиката.
-- Да се напише функция, която приема списък и предикат. Тя трябва да върне всички елементи до първия, който не удовлетворява предиката
-- Да се напише функция, която приема два списъка и функция и връща нов списък, получен чрез прилагане на функцията върху елементите на един и същ индекс.

-- Дефиниране на типове
-- data vs type vs newtype
-- Record
-- На който му е интересно: https://stackoverflow.com/questions/5889696/difference-between-data-and-newtype-in-haskell

-- Да се дефинира тип за вид на животно
-- Да се дефинира тип, който представлява наредена двойка от животно и неговото име
-- Да се дефинира тип за човек. Всеки човек има име, възраст и домашен любимец
-- Да се дефинира тип Zoopark, който представлява списък от животни
-- Да се напише функция, която брои колко лъва има в един зоопарк
-- Да се дефинира тип за двумерна матрица
-- Да се напише функция, която транспонира матрица
-- Да се напише функция, която умножава две матрици
